package ex02연산자;

public class ex04연산자정리 {

	public static void main(String[] args) {

		
		// 1. 대입연산자
		// : 복합대입연사잔 !!! : += -= *=
		// ex) a =+ b --> a = a+b
		
		// 2. 증감연산자
		// : 변수안에 들어있는 데이터를 1씩 증가, 1씩 감소
		// ++, --
		// : 해당하는 기호가 변수를 기준으로 앞쪽에 붙어있는지,
		//   뒤쪽에 붙어있는지에 따라 연산결과가 달라진다.
		
		// 3. 비교연산자
		// <, <=, >=, !=, ==
		// : 연산결과값이(boolean(논리자료형)으로 나온다.
		
		// 4. 논리연산자
		// !(not), &&(and), ||(or)
		// : 연산을 당하는 항이 boolean(논리자료형)이어야 한다.
		// : 연산결과값이 boolean(논리자료형)으로 나온다.
		// ex) true && false --> false
	}

}
